Revit 2027 API
ExporterIFC.GetFile Method
 Gets the handle to the IFC file being created during this export operation.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCFile GetFile()
Public Function GetFile As IFCFile
public:
IFCFile^ GetFile()
member GetFile : unit -> IFCFile
Return Value
IFCFile
 The handle to the file.
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace